artillery.yml
config:
  target: "http://smcadamslbdns.eastus.cloudapp.azure.com"
  phases:
    -
      duration: 20
      arrivalRate: 10
scenarios:
  -
    name: "Create and Get"
    flow:
      -
        post:
          url: "/api/entities/create"
          capture:
            json: "$.guid"
            as: "guid"
      -
        get:
          url: "/api/entities/{{ guid }}"