artillery.yml
config:
  target: "http://smcadams.eastus.cloudapp.azure.com"
  phases:
    -
      duration: 60
      arrivalRate: 5
scenarios:
  -
    name: "Create and Get"
    flow:
      -
        post:
          url: "/api/entities/create"
          capture:
            json: "$.guid"
            as: "guid"
      -
        get:
          url: "/api/entities/{{ guid }}"