artillery.yml
config:
  target: "http://13.82.236.162"
  phases:
    -
      duration: 60
      arrivalRate: 10000
scenarios:
  -
    name: "Test and Validate"
    flow:
      -
        get:
          url: "/Home/TestCreate"
          capture:
            json: "$.guid"
            as: "guid"
      -
        post:
          url: "/Home/TestValidate"
          body: "guid={{ guid }}"